#include <Arduino.h>
#include "buzzer_action.h"
#include "variables.h"

// ==========================================================================================================================================================
// Работа с динамиком

// Воспроизвести мелодию "доступ запрещен"
void AccessDeniedSound(){
  tone(PIEZO_PIN, 349, 500);
  delay(100);
  tone(PIEZO_PIN, 220, 200);
}

// Воспроизвести мелодию "доступ разрешен"
void AccessAllowedSound(){
  tone(PIEZO_PIN, 523, 100);
  delay(150);  
  tone(PIEZO_PIN, 1319, 100);
  delay(150);
  tone(PIEZO_PIN, 987, 500);
}
// ==========================================================================================================================================================