// ------------------------ УПРАВЛЕНИЕ ЛАМПАМИ -------------------
/* 
  API для включеня и выключения светодиодов.
  Всего три светодиода: 
  - красный
  - зеленый
  - синий
*/

// OnRed - включить красный светодиод
void OnRed();

// OffRed - выключить красный светодиод
void OffRed();

// OnGreen - включить зеленый светодиод
void OnGreen();

// OffGreen - выключить зеленый светодиод
void OffGreen();

// OnBlue - включить синий светодиод
void OnBlue();

// OffBlue - выключить синий светодиод
void OffBlue();
// ------------------------ УПРАВЛЕНИЕ ЛАМПАМИ -------------------