// ==========================================================================================================================================================
// Работа с светодиодом
// Включить красный светодиод
void OnRed();

// Выключить красный светодиод
void OffRed();

// Включить зеленый светодиод
void OnGreen();

// Выключить зеленый светодиод
void OffGreen();

// Включить синий светодиод
void OnBlue();

// Выключить синий светодиод
void OffBlue();
// ==========================================================================================================================================================